'''
Problem:
주어진 자연수가 홀수인지 짝수인지 판별해 주는 함수(is_odd)를 작성해 보자.
'''

'''
Funtions
---------------------------------
'''

def is_odd(a):
    i = a % 2
    if i == 0:
        print("짝수입니다.")
    else:
        print("홀수입니다.")
    return 0

'''
----------------------------------
'''

'''
------------------------------------- Start
'''

print('''자연수를 입력하여 짝/홀수를 판별합니다.
프로그램을 종료하려면 0을 입력하세요.''')

x = input("숫자를 입력하세요: ")

while True:
    if x.isdigit() == 0:
        x = input("다시 입력하세요: ")
    if x.isdigit() == 1:
        if int(x) == 0:
            print("프로그램을 종료합니다.")
            break
        is_odd(int(x))
        x = input("숫자를 입력하세요: ")

'''
------------------------------------ End
'''
